gaetangaetan/ESP32-D1-MINI-DMX-SENDER/src/main.cpp
struct_dmx_packet outgoingDMXPacket;
AnimationTriggerMessage incomingAnimationTrigger;

// Adresse MAC du récepteur ESP8266
uint8_t receiverAddress[] = {0x2C, 0xF4, 0x32, 0x7A, 0x08, 0x1E};

// Adresse MAC de l'Onirigun
uint8_t onirigunAddress[] = {0x68, 0xC6, 0x3A, 0xFD, 0x37, 0x17};

// Variables pour le trigger externe de l'Onirigun
bool externalTriggerActive = false;
unsigned long externalTriggerTime = 0;
const unsigned long EXTERNAL_TRIGGER_DURATION = 100; // 100ms de durée du trigger

esp_now_peer_info_t peerInfo; // Configuration du peer récepteur ESP8266

// Variables de timing
unsigned long lastEmissionTime = 0;
const unsigned long EMISSION_INTERVAL = 1000 / EMISSION_FREQUENCY; // 20ms pour 50Hz

// Variables pour les boutons PCF8574
bool buttonStates[3] = {false, false, false};
bool lastButtonStates[3] = {false, false, false};
unsigned long lastButtonPress[3] = {0, 0, 0};
const unsigned long BUTTON_DEBOUNCE = 100; // 200ms de debounce

// Variables pour les interruptions de boutons
volatile bool buttonInterruptFlags[3] = {false, false, false};
volatile unsigned long buttonInterruptTimes[3] = {0, 0, 0};

// Variables pour les faders
uint8_t faderValues[3] = {0, 0, 0};
uint8_t lastFaderValues[3] = {0, 0, 0};

// Variables pour l'encodeur
int32_t lastEncoderValue = 0;
uint8_t selectedPreset = 1;  // Index du preset sélectionné (0-9)
bool encoderButtonPressed = false;
unsigned long lastEncoderButtonPress = 0;

// Variables pour l'affichage
unsigned long lastDisplayUpdate = 0;
const unsigned long DISPLAY_UPDATE_INTERVAL = 100; // 100ms entre les mises à jour

// Variable pour le compteur d'affichage
uint16_t displayCounter = 0;

// Variables pour la stabilisation des capteurs IR - VERSION SIMPLIFIÉE
#define IR_SAMPLE_SIZE 10        // Taille de la moyenne mobile (ajustable)
#define IR_MAX_DEVIATION 50      // Limite des écarts autorisés (ajustable)

int irBuffer1[IR_SAMPLE_SIZE];   // Buffer pour IR1
int irBuffer2[IR_SAMPLE_SIZE];   // Buffer pour IR2
int irIndex1 = 0;                // Index circulaire IR1
int irIndex2 = 0;                // Index circulaire IR2
int irSum1 = 0;                  // Somme IR1
int irSum2 = 0;                  // Somme IR2
bool irInitialized1 = false;     // Initialisation IR1
bool irInitialized2 = false;     // Initialisation IR2

// Variables pour le dimmer RGB avec inertie
float dimmerValue1 = 0.0;        // Valeur actuelle du dimmer IR1 (0.0-1.0)
float dimmerValue2 = 0.0;        // Valeur actuelle du dimmer IR2 (0.0-1.0)
uint8_t rgb1RedDimmed = 0;       // RGB1 rouge dimmé
uint8_t rgb1GreenDimmed = 0;     // RGB1 vert dimmé
uint8_t rgb1BlueDimmed = 0;      // RGB1 bleu dimmé
uint8_t rgb2RedDimmed = 0;       // RGB2 rouge dimmé
uint8_t rgb2GreenDimmed = 0;     // RGB2 vert dimmé
uint8_t rgb2BlueDimmed = 0;      // RGB2 bleu dimmé

// Variables pour la transposition du pitch
int8_t transpose = 0;           // Valeur de transposition (-12 à +12)
uint8_t transpose_factor = 24;  // Facteur de transposition

// Prototypes
void displayUnified();

// Fonction pour stabiliser un capteur IR avec moyenne mobile et limitation d'aberrants
int stabilizeIRSensor(int newValue, int* buffer, int& index, int& sum, bool& initialized) {
  // Initialisation : remplir le buffer avec la première valeur
  if (!initialized) {
    for (int i = 0; i < IR_SAMPLE_SIZE; i++) {
      buffer[i] = newValue;
    }
    sum = newValue * IR_SAMPLE_SIZE;
    initialized = true;
  }
  
  // Calculer la moyenne actuelle
  int currentAverage = sum / IR_SAMPLE_SIZE;
  
  // Vérifier si la nouvelle valeur est aberrante
  int deviation = abs(newValue - currentAverage);
  
  if (deviation > IR_MAX_DEVIATION) {
    // Valeur aberrante : la limiter à moyenne ± seuil
    int limitedValue;
    if (newValue > currentAverage) {
      limitedValue = currentAverage + IR_MAX_DEVIATION;
    } else {
      limitedValue = currentAverage - IR_MAX_DEVIATION;
    }
    
    // Mettre à jour le buffer avec la valeur limitée
    sum -= buffer[index];
    buffer[index] = limitedValue;
    sum += limitedValue;
  } else {
    // Valeur normale : l'ajouter au buffer
    sum -= buffer[index];
    buffer[index] = newValue;
    sum += newValue;
  }
  
  // Passer à l'index suivant (buffer circulaire)
  index = (index + 1) % IR_SAMPLE_SIZE;
  
  // Retourner la moyenne
  return sum / IR_SAMPLE_SIZE;
}

void OnDataSent(const uint8_t *mac_addr, esp_now_send_status_t status)
{
  // Callback pour le statut d'envoi (optionnel)
}

// Callback pour la réception de données ESP-NOW
void OnDataRecv(const uint8_t *mac_addr, const uint8_t *data, int data_len)
{
  // Vérifier que le message vient bien de l'Onirigun
  bool isFromOnirigun = true;
  for (int i = 0; i < 6; i++) {
    if (mac_addr[i] != onirigunAddress[i]) {
      isFromOnirigun = false;
      break;
    }
  }
  
  // Ignorer tous les messages qui ne proviennent pas de l'Onirigun
  if (!isFromOnirigun) {
    return; // Sortir immédiatement sans traiter le message
  }
  
  // Vérifier si c'est un message d'animation de l'Onirigun
  if (data_len == sizeof(AnimationTriggerMessage)) {
    memcpy(&incomingAnimationTrigger, data, sizeof(AnimationTriggerMessage));
    
    // Debug
    // Serial.print("Message Onirigun reçu - Animation: ");
    // Serial.println(incomingAnimationTrigger.animationNumber);
    
    // Vérifier si c'est un message de trigger (type 0xA0)
    if (incomingAnimationTrigger.type == 0xA0) {
      // Vérifier s'il y a une collision avec un trigger déjà actif
      if (dmxValues[118] > 0) {
        Serial.print("COLLISION DÉTECTÉE ! Trigger déjà actif (valeur restante: ");
        Serial.print(dmxValues[118]);
        Serial.println(") - Redémarrage du trigger");
      } else {
        Serial.println("Nouveau trigger - Canal libre");
      }
      
      // Activer le trigger externe (toujours, même en cas de collision)
      externalTriggerActive = true;
      externalTriggerTime = millis();
      
      // Déclencher la même action que le bouton 3 (trig_hh)
      dmxValues[118] = TRIG_LENGTH; // Canal DMX 119 (trig_hh)
      Serial.print("Trigger externe - Trig HH déclenché - Valeur DMX: ");
      Serial.print(dmxValues[118]);
      Serial.print(" - Durée estimée: ");
      Serial.print(TRIG_LENGTH * 20);
      Serial.println("ms");
    } else {
      Serial.print("Message Onirigun reçu avec type invalide: 0x");
      Serial.println(incomingAnimationTrigger.type, HEX);
    }
  }
  // Message de taille inconnue de l'Onirigun
  else {
    Serial.print("Message Onirigun de taille inconnue ignoré: ");
    Serial.println(data_len);
  }
}

// Fonction pour mettre à jour un paramètre par son nom
void setParameter(const char* paramName, uint8_t value) {
  for (int i = 0; i < PRESET_SIZE; i++) {
    if (strcmp(parameters[i].name, paramName) == 0) {
      // Vérifier si c'est le paramètre pitch (indice 1)
      if (i == 1) { // pitch
        // Appliquer la transposition
        int transposedValue = (int)value + (transpose * transpose_factor);
        
        // Limiter la valeur entre 0 et 255
        if (transposedValue < 0) transposedValue = 0;
        if (transposedValue > 255) transposedValue = 255;
        
        parameters[i].value = (uint8_t)transposedValue;
        // Mettre à jour le tableau DMX
        dmxValues[parameters[i].dmxChannel - 1] = (uint8_t)transposedValue;
        
        // Debug de la transposition
        // Serial.print("Pitch transposé: ");
        // Serial.print(value);
        // Serial.print(" + (");
        // Serial.print(transpose);
        // Serial.print(" × ");
        // Serial.print(transpose_factor);
        // Serial.print(") = ");
        // Serial.println(transposedValue);
      } else {
        // Pour les autres paramètres, comportement normal
        parameters[i].value = value;
        // Mettre à jour le tableau DMX
        dmxValues[parameters[i].dmxChannel - 1] = value;
      }
      return;
    }
  }
  //Serial.println("Paramètre " + String(paramName) + " non trouvé");
}

// Fonction pour mettre à jour le gate_threshold avec la transposition
void updateGateThresholdWithTranspose() {
  // Récupérer la valeur par défaut du preset pour gate_threshold
  uint8_t originalGateThreshold = presets[selectedPreset].values[7]; // indice 7 = gate_threshold
  
  // Appliquer la transposition
  int transposedGateThreshold = (int)originalGateThreshold + (transpose * transpose_factor);
  
  // Limiter la valeur entre 0 et 255
  if (transposedGateThreshold < 0) transposedGateThreshold = 0;
  if (transposedGateThreshold > 255) transposedGateThreshold = 255;
  
